article/setup-npm-and-yarn.org
#+TITLE: 配置 npm 和 yarn
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2018-10-08 Mon>
#+TAGS: npm yarn taobao 


* 配置

npm 是 nodejs 默认的包管理工具，[[http://www.yarnpkg.com][yarn ]]是 npm 的一个改进版，它缓存存了每个下载过的
包,所以再次使用时无需重复下载。

在配置国内镜像源的时候需要配置以下两个文件：

- *~/.npmrc*
  #+BEGIN_SRC conf
    registry=https://registry.npm.taobao.org/
    disturl=https://npm.taobao.org/dist
  #+END_SRC

- *~/.yarnrc*
  #+BEGIN_SRC conf
    registry "https://registry.npm.taobao.org"
  #+END_SRC

或者直接使用配置命令来设置源

#+BEGIN_SRC sh
  npm config set registry=https://registry.npm.taobao.org
  npm config set disturl https://npm.taobao.org/dist

  yarn config set registry https://registry.npm.taobao.org
#+END_SRC


* 常用命令

** 下载项目包

根据 *package.json* 文件中的引用记录将镜像源中的包下载到本地 *node_modules* 文件
夹中。

#+BEGIN_SRC sh
  npm install
  # or
  yarn install
#+END_SRC

** 全局安装包

将一些命令行工具安装到全局包仓库中

#+BEGIN_SRC sh
  npm install -g package-name
  # or
  yarn global add package-name
#+END_SRC

** 安装项目模块

给当前项目添加一个包，并将引用信息添加的 *package.json* 文件中。

#+BEGIN_SRC sh
  npm install --save  package-name
  npm install --save-dev package-name
  # or
  yarn add package-name
  yarn add package-name@1.2.3 # installs a specific version of a package from the registry.
  yarn add --dev package-name
#+END_SRC

** 卸载项目模块

卸载将当前项目中的制定模块，并且更新 *package.json* 文件中的相关信息。

#+BEGIN_SRC sh
  npm uninstall package-name
  npm uninstall package-name --save-dev
  # or
  yarn remove package-name
  yarn remove package-name --dev
#+END_SRC

** 升级项目模块

基于 *package.json* 和 *yarn.lock* 中的信息来升级一个特点项目模块。

#+BEGIN_SRC sh
  npm update package-name
  npm upgrade package-name # upgrade is an alias of update
  # or
  yarn upgrade package-name
  yarn upgrade --latest package-name
#+END_SRC


* 参考链接

1. [[https://yarnpkg.com/en/][yarn]]：yarn 文档
2. [[https://yarnpkg.com/zh-Hans/][yarn zh]]: yarn 中文文档
3. [[https://yarnpkg.com/en/docs/cli/][yarn cli]]：yarn 命令行手册
4. [[https://docs.npmjs.com/][npm]]：npm 文档，包括 npm 的介绍和命令说明
