article/setup-npm-and-yarn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-03 Wed 22:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>配置 npm 和 yarn</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="content">
<h1 class="title">配置 npm 和 yarn</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org46dcb35">1. 配置</a></li>
<li><a href="#org3a74d25">2. 常用命令</a>
<ul>
<li><a href="#orgd5207b2">2.1. 下载项目包</a></li>
<li><a href="#org22ad73a">2.2. 全局安装包</a></li>
<li><a href="#org90d05aa">2.3. 安装项目模块</a></li>
<li><a href="#org6cf726a">2.4. 卸载项目模块</a></li>
<li><a href="#orge7c1f4c">2.5. 升级项目模块</a></li>
</ul>
</li>
<li><a href="#orge306108">3. 参考链接</a></li>
</ul>
</div>
</div>


<div id="outline-container-org46dcb35" class="outline-2">
<h2 id="org46dcb35"><span class="section-number-2">1</span> 配置</h2>
<div class="outline-text-2" id="text-1">
<p>
npm 是 nodejs 默认的包管理工具，<a href="http://www.yarnpkg.com">yarn </a>是 npm 的一个改进版，它缓存存了每个下载过的
包,所以再次使用时无需重复下载。
</p>

<p>
在配置国内镜像源的时候需要配置以下两个文件：
</p>

<ul class="org-ul">
<li><p>
<b>~/.npmrc</b>
</p>
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #6c71c4;">registry</span>=https://registry.npm.taobao.org/
<span style="color: #6c71c4;">disturl</span>=https://npm.taobao.org/dist
</pre>
</div></li>

<li><p>
<b>~/.yarnrc</b>
</p>
<div class="org-src-container">
<pre class="src src-conf">registry <span style="color: #2aa198;">"https://registry.npm.taobao.org"</span>
</pre>
</div></li>
</ul>

<p>
或者直接使用配置命令来设置源
</p>

<div class="org-src-container">
<pre class="src src-sh">npm config set <span style="color: #6c71c4;">registry</span>=https://registry.npm.taobao.org
npm config set disturl https://npm.taobao.org/dist

yarn config set registry https://registry.npm.taobao.org
</pre>
</div>
</div>
</div>


<div id="outline-container-org3a74d25" class="outline-2">
<h2 id="org3a74d25"><span class="section-number-2">2</span> 常用命令</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd5207b2" class="outline-3">
<h3 id="orgd5207b2"><span class="section-number-3">2.1</span> 下载项目包</h3>
<div class="outline-text-3" id="text-2-1">
<p>
根据 <b>package.json</b> 文件中的引用记录将镜像源中的包下载到本地 <b>node<sub>modules</sub></b> 文件
夹中。
</p>

<div class="org-src-container">
<pre class="src src-sh">npm install
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">or</span>
yarn install
</pre>
</div>
</div>
</div>

<div id="outline-container-org22ad73a" class="outline-3">
<h3 id="org22ad73a"><span class="section-number-3">2.2</span> 全局安装包</h3>
<div class="outline-text-3" id="text-2-2">
<p>
将一些命令行工具安装到全局包仓库中
</p>

<div class="org-src-container">
<pre class="src src-sh">npm install -g package-name
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">or</span>
yarn global add package-name
</pre>
</div>
</div>
</div>

<div id="outline-container-org90d05aa" class="outline-3">
<h3 id="org90d05aa"><span class="section-number-3">2.3</span> 安装项目模块</h3>
<div class="outline-text-3" id="text-2-3">
<p>
给当前项目添加一个包，并将引用信息添加的 <b>package.json</b> 文件中。
</p>

<div class="org-src-container">
<pre class="src src-sh">npm install --save  package-name
npm install --save-dev package-name
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">or</span>
yarn add package-name
yarn add package-name@1.2.3 <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">installs a specific version of a package from the registry.</span>
yarn add --dev package-name
</pre>
</div>
</div>
</div>

<div id="outline-container-org6cf726a" class="outline-3">
<h3 id="org6cf726a"><span class="section-number-3">2.4</span> 卸载项目模块</h3>
<div class="outline-text-3" id="text-2-4">
<p>
卸载将当前项目中的制定模块，并且更新 <b>package.json</b> 文件中的相关信息。
</p>

<div class="org-src-container">
<pre class="src src-sh">npm uninstall package-name
npm uninstall package-name --save-dev
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">or</span>
yarn remove package-name
yarn remove package-name --dev
</pre>
</div>
</div>
</div>

<div id="outline-container-orge7c1f4c" class="outline-3">
<h3 id="orge7c1f4c"><span class="section-number-3">2.5</span> 升级项目模块</h3>
<div class="outline-text-3" id="text-2-5">
<p>
基于 <b>package.json</b> 和 <b>yarn.lock</b> 中的信息来升级一个特点项目模块。
</p>

<div class="org-src-container">
<pre class="src src-sh">npm update package-name
npm upgrade package-name <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">upgrade is an alias of update</span>
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">or</span>
yarn upgrade package-name
yarn upgrade --latest package-name
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orge306108" class="outline-2">
<h2 id="orge306108"><span class="section-number-2">3</span> 参考链接</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="https://yarnpkg.com/en/">yarn</a>：yarn 文档</li>
<li><a href="https://yarnpkg.com/zh-Hans/">yarn zh</a>: yarn 中文文档</li>
<li><a href="https://yarnpkg.com/en/docs/cli/">yarn cli</a>：yarn 命令行手册</li>
<li><a href="https://docs.npmjs.com/">npm</a>：npm 文档，包括 npm 的介绍和命令说明</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-10-08 Mon 00:00</p>
<p class="author">Author: Jinghui Hu</p>
<p class="date">Created: 2019-07-03 Wed 22:52</p>
<p class="validation"></p>
</div>
</body>
</html>
